from datetime import datetime
from django.views.generic import ListView, DetailView
from .models import Post


class PostList(ListView):
    # РЈРєР°Р·С‹РІР°РµРј РјРѕРґРµР»СЊ, РѕР±СЉРµРєС‚С‹ РєРѕС‚РѕСЂРѕР№ РјС‹ Р±СѓРґРµРј РІС‹РІРѕРґРёС‚СЊ
    model = Post
    # РџРѕР»Рµ, РєРѕС‚РѕСЂРѕРµ Р±СѓРґРµС‚ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊСЃСЏ РґР»СЏ СЃРѕСЂС‚РёСЂРѕРІРєРё РѕР±СЉРµРєС‚РѕРІ
    ordering = 'dateCreation'
    # РЈРєР°Р·С‹РІР°РµРј РёРјСЏ С€Р°Р±Р»РѕРЅР°, РІ РєРѕС‚РѕСЂРѕРј Р±СѓРґСѓС‚ РІСЃРµ РёРЅСЃС‚СЂСѓРєС†РёРё Рѕ С‚РѕРј,
    # РєР°Рє РёРјРµРЅРЅРѕ РїРѕР»СЊР·РѕРІР°С‚РµР»СЋ РґРѕР»Р¶РЅС‹ Р±С‹С‚СЊ РїРѕРєР°Р·Р°РЅС‹ РЅР°С€Рё РѕР±СЉРµРєС‚С‹
    template_name = 'posts.html'
    # Р­С‚Рѕ РёРјСЏ СЃРїРёСЃРєР°, РІ РєРѕС‚РѕСЂРѕРј Р±СѓРґСѓС‚ Р»РµР¶Р°С‚СЊ РІСЃРµ РѕР±СЉРµРєС‚С‹.
    # Р•РіРѕ РЅР°РґРѕ СѓРєР°Р·Р°С‚СЊ, С‡С‚РѕР±С‹ РѕР±СЂР°С‚РёС‚СЊСЃСЏ Рє СЃРїРёСЃРєСѓ РѕР±СЉРµРєС‚РѕРІ РІ html-С€Р°Р±Р»РѕРЅРµ.
    context_object_name = 'newsposts'
    paginate_by = 10  # количество записей на странице

    def get_queryset(self):
        return Post.objects.filter(categoryType='NW')

class PostDetail(DetailView):
    # РњРѕРґРµР»СЊ РІСЃС‘ С‚Р° Р¶Рµ, РЅРѕ РјС‹ С…РѕС‚РёРј РїРѕР»СѓС‡Р°С‚СЊ РёРЅС„РѕСЂРјР°С†РёСЋ РїРѕ РѕС‚РґРµР»СЊРЅРѕРјСѓ С‚РѕРІР°СЂСѓ
    model = Post
    # РСЃРїРѕР»СЊР·СѓРµРј РґСЂСѓРіРѕР№ С€Р°Р±Р»РѕРЅ вЂ” post.html
    template_name = 'post.html'
    # РќР°Р·РІР°РЅРёРµ РѕР±СЉРµРєС‚Р°, РІ РєРѕС‚РѕСЂРѕРј Р±СѓРґРµС‚ РІС‹Р±СЂР°РЅРЅС‹Р№ РїРѕР»СЊР·РѕРІР°С‚РµР»РµРј РЅРѕРІРѕСЃС‚СЊ
    context_object_name = 'newspost'

    def get_context_data(self, **kwargs):
        # РЎ РїРѕРјРѕС‰СЊСЋ super() РјС‹ РѕР±СЂР°С‰Р°РµРјСЃСЏ Рє СЂРѕРґРёС‚РµР»СЊСЃРєРёРј РєР»Р°СЃСЃР°Рј
        # Рё РІС‹Р·С‹РІР°РµРј Сѓ РЅРёС… РјРµС‚РѕРґ get_context_data СЃ С‚РµРјРё Р¶Рµ Р°СЂРіСѓРјРµРЅС‚Р°РјРё,
        # С‡С‚Рѕ Рё Р±С‹Р»Рё РїРµСЂРµРґР°РЅС‹ РЅР°Рј.
        # Р’ РѕС‚РІРµС‚Рµ РјС‹ РґРѕР»Р¶РЅС‹ РїРѕР»СѓС‡РёС‚СЊ СЃР»РѕРІР°СЂСЊ.
        context = super().get_context_data(**kwargs)
        # Рљ СЃР»РѕРІР°СЂСЋ РґРѕР±Р°РІРёРј С‚РµРєСѓС‰СѓСЋ РґР°С‚Сѓ РІ РєР»СЋС‡ 'time_now'.
        context['time_now'] = datetime.utcnow()
        # Р”РѕР±Р°РІРёРј РµС‰С‘ РѕРґРЅСѓ РїСѓСЃС‚СѓСЋ РїРµСЂРµРјРµРЅРЅСѓСЋ,
        # С‡С‚РѕР±С‹ РЅР° РµС‘ РїСЂРёРјРµСЂРµ СЂР°СЃСЃРјРѕС‚СЂРµС‚СЊ СЂР°Р±РѕС‚Сѓ РµС‰С‘ РѕРґРЅРѕРіРѕ С„РёР»СЊС‚СЂР°.
        context['next_sale'] = None
        return context

    def get_queryset(self):
        return Post.objects.filter(categoryType='NW')